import React from 'react';
function UserAgreePage() {

    return (
        <div>
            회원 정책

1) 회원의 정의
① 회원이란 뭉게구름(이하 “커뮤니티”)이 제공하는 인터넷 소통 서비스(이하 "서비스")에 접속하여 본 약관에 따라 회사의 이용 절차에 동의하고 회사가 제공하는 서비스를 이용하는 이용자를 말합니다.

2) 회원가입
① 회원이 되고자 하는 자는 회사가 정한 가입 양식에 따라 회원 정보를 기입하고 "동의", "확인" 등의 버튼을 누르는 방법으로 회원가입을 신청합니다.
② 커뮤니티는 회원으로 가입할 것을 신청한 자가 다음 각 호에 해당하지 않는 한 신청한 자를 회원으로 등록합니다.
1. 유효하지 않은 이메일, 연락처를 기재하는 경우
2. 개인 식별 요소가 있어야 하는 내용에 중복된 데이터가 있는 경우
3. 기타 회원으로 등록하는 것이 커뮤니티의 서비스 운영 및 기술상 현저히 지장이 있다고 판단되는 경우
③ 회원가입 시 필요한 양식 및 제한사항은 아래와 같습니다
1. 아이디: 영문 포함 6자 이상, 중복 불가
2. 비밀번호: 영문과 숫자 혼합 8자리 이상
3. 닉네임: 중복 불가
4. 이메일: 중복 불가
④ 회원가입 시 연령 제한사항은 없습니다.
⑤ 하나의 명의로 중복 회원가입은 불가능합니다.

3) 회원 정보 변경
① 회원은 아래 각 호에 해당하는 사항이 변경되었을 경우 회원 정보 관리페이지에서 이를 변경할 수 있습니다.
1. 비밀번호
2. 닉네임
3. 이메일

4) 회원 탈퇴
① 회원은 커뮤니티에 언제든지 자신의 회원 등록 말소(회원 탈퇴)를 요청할 수 있으며 커뮤니티는 위 요청을 받은 즉시 해당 회원의 회원 등록 말소를 위한 절차를 밟습니다.
② 회원 탈퇴가 이루어진 경우에도 모든 게시판에 등록된 게시물은 일체 삭제가 되지 않으며 보존이 되어집니다.
③ 회원이 다음 각 호의 사유에 해당하는 경우, 커뮤니티는 회원의 회원자격을 적절한 방법으로 제한 및 정지, 상실시킬 수 있습니다.
1. 가입 신청 시에 허위 내용을 등록한 경우
2. 다른 사람의 서비스 이용을 방해하거나 그 정보를 도용하는 등 질서를 위협하는 경우
3. 서비스를 이용하여 법령과 본 약관이 금지하거나 공서양속에 반하는 행위를 하는 경우
4. 게시판 정책에 위배되는 경우

5) 회원 구분
① 커뮤니티의 이용자는 후술할 기준에 따라 다음 각 호로 구분됩니다.
1. 비회원
a. 로그인되지 않은 사용자를 의미합니다.
b. 비회원으로 커뮤니티 사용 시 특정 서비스 이용에 제약이 있습니다.
2. 회원
a. 회원가입 절차를 끝마쳐 커뮤니티 서비스를 사용 가능한 사용자를 의미합니다.
3. 장기 미접속 회원(이하 “휴면 회원”)
a. 일정 기간 이상 로그인 기록이 없는 회원을 의미합니다.
b. 이용자가 개인정보 인증을 통해 회원으로 복귀할 수 있습니다.
c. 휴면 회원으로 전환된 후 연속하여 1년 동안 서비스를 이용하기 위해 로그인 기록이 없는 경우, 커뮤니티는 회원의 회원자격을 상실시킬 수 있습니다.
4. 블랙리스트 회원
a. 게시판 정책에 위반하는 등의 사유가 발생하여 특정 기한 동안 서비스 이용이 제한된 사용자를 의미합니다.
b. 서비스의 이용을 제한하거나 중지한 때에는 그 사유 및 제한 기간 등을 회원에게 알려야 합니다.
c. 제한 기간은 관리자가 해당 회원의 제한당한 횟수, 게시판 정책 위반 정도 등을 재량껏 판단하여 7일, 30일, 3개월, 무기한 단위로 지정할 수 있습니다.


게시판 정책

1) 회원의 게시물의 내용이 다음 각 호에 해당하는 경우 커뮤니티는 회원에게 사전 통지 없이 해당 게시물을 삭제 또는 변경할 수 있고, 경우에 따라 해당 회원의 회원자격을 제한, 정지 또는 상실시킬 수 있습니다.
① 음란물, 욕설 등 공서양속에 위반되는 내용의 정보, 문장, 도형 등을 유포하는 내용
② 범죄행위와 관련이 있다고 판단되는 내용
③ 다른 회원 또는 제3자의 저작권 등 기타 권리를 침해하는 내용
④ 타인의 개인정보, 사생활을 침해하거나 명예를 훼손하는 경우
⑤ 동일한 내용을 중복하여 다수 게시하는 등 게시의 목적에 어긋나는 경우
⑥ 불필요하거나 승인되지 않은 광고, 판촉물을 게재하는 경우
⑦ 규정한 게시물 원칙에 어긋나거나, 게시판 성격에 부합되지 않는 경우
⑧ 컴퓨터, 이동통신 장비의 정상적인 가동을 방해, 파괴할 목적으로 고안된 바이러스 파일, 프로그램 코드를 포함하고 있는 자료를 게시하거나 전송하는 행위
⑨ 기타 관계 법령에 위배 된다고 판단되는 경우


개인정보보호 정책

  ① 커뮤니티는 이용자의 개인정보 수집시 서비스제공을 위하여 필요한 범위에서 최소한의 개인정보를 수집합니다. 
  ② 커뮤니티는 회원가입시 구매계약이행에 필요한 정보를 미리 수집하지 않습니다. 다만, 관련 법령상 의무이행을 위하여 구매계약 이전에 본인확인이 필요한 경우로서 최소한의 특정 개인정보를 수집하는 경우에는 그러하지 아니합니다.
  ③ 커뮤니티는 이용자의 개인정보를 수집·이용하는 때에는 당해 이용자에게 그 목적을 고지하고 동의를 받습니다. 
  ④ 커뮤니티는 수집된 개인정보를 목적외의 용도로 이용할 수 없으며, 새로운 이용목적이 발생한 경우 또는 제3자에게 제공하는 경우에는 이용·제공단계에서 당해 이용자에게 그 목적을 고지하고 동의를 받습니다. 다만, 관련 법령에 달리 정함이 있는 경우에는 예외로 합니다.
  ⑤ 커뮤니티가 이용자의 동의를 받아야 하는 경우에는 개인정보관리 책임자의 신원(소속, 성명 및 전화번호, 기타 연락처), 정보의 수집목적 및 이용목적, 제3자에 대한 정보제공 관련사항(제공받은자, 제공목적 및 제공할 정보의 내용) 등 「정보통신망 이용촉진 및 정보보호 등에 관한 법률」 제22조제2항이 규정한 사항을 미리 명시하거나 고지해야 하며 이용자는 언제든지 이 동의를 철회할 수 있습니다.
  ⑥ 이용자는 언제든지 커뮤니티가 가지고 있는 자신의 개인정보에 대해 열람 및 오류정정을 요구할 수 있으며 커뮤니티는 이에 대해 지체 없이 필요한 조치를 취할 의무를 집니다. 이용자가 오류의 정정을 요구한 경우에는 커뮤니티는 그 오류를 정정할 때까지 당해 개인정보를 이용하지 않습니다.
  ⑦ 커뮤니티는 개인정보 보호를 위하여 이용자의 개인정보를 취급하는 자를  최소한으로 제한하여야 하며 신용카드, 은행계좌 등을 포함한 이용자의 개인정보의 분실, 도난, 유출, 동의 없는 제3자 제공, 변조 등으로 인한 이용자의 손해에 대하여 모든 책임을 집니다.
  ⑧ 커뮤니티 또는 그로부터 개인정보를 제공받은 제3자는 개인정보의 수집목적 또는 제공받은 목적을 달성한 때에는 당해 개인정보를 지체 없이 파기합니다.
  ⑨ 커뮤니티는 개인정보의 수집·이용·제공에 관한 동의 란을 미리 선택한 것으로 설정해두지 않습니다. 또한 개인정보의 수집·이용·제공에 관한 이용자의 동의거절시 제한되는 서비스를 구체적으로 명시하고, 필수수집항목이 아닌 개인정보의 수집·이용·제공에 관한 이용자의 동의 거절을 이유로 회원가입 등 서비스 제공을 제한하거나 거절하지 않습니다.


커뮤니티의 의무

  ① 커뮤니티는 법령과 이 약관이 금지하거나 공서양속에 반하는 행위를 하지 않으며 이 약관이 정하는 바에 따라 지속적이고, 안정적으로 재화․용역을 제공하는데 최선을 다하여야 합니다.
  ② 커뮤니티는 이용자가 안전하게 인터넷 서비스를 이용할 수 있도록 이용자의 개인정보(신용정보 포함)보호를 위한 보안 시스템을 갖추어야 합니다.
  ③ 커뮤니티가 상품이나 용역에 대하여 「표시․광고의 공정화에 관한 법률」 제3조 소정의 부당한 표시․광고행위를 함으로써 이용자가 손해를 입은 때에는 이를 배상할 책임을 집니다.
  ④ 커뮤니티는 이용자가 원하지 않는 영리목적의 광고성 전자우편을 발송하지 않습니다.


회원의 ID 및 비밀번호에 대한 의무

  ①  「개인정보보호 정책」의 경우를 제외한 ID와 비밀번호에 관한 관리책임은 회원에게 있습니다.
  ② 회원은 자신의 ID 및 비밀번호를 제3자에게 이용하게 해서는 안됩니다.
  ③ 회원이 자신의 ID 및 비밀번호를 도난당하거나 제3자가 사용하고 있음을 인지한 경우에는 바로 커뮤니티에 통보하고 커뮤니티의 안내가 있는 경우에는 그에 따라야 합니다.


저작권 정책

  ① 커뮤니티가 작성한 저작물에 대한 저작권 기타 지적재산권은 “저작자표시-비영리(CC BY-NC)”를 따릅니다.
  ② 사용자가 게시글을 업로드하는 순간 해당 게시글은 사이트 회원 누구나 복제, 송신, 출판, 배포, 변경이 가능합니다.
  ③ 2호에 따라 복제, 송신, 출판, 배포, 변경을 할 시 반드시 원저작자 및 출처를 표시합니다.
  ④ 2차 저작물의 라이선스를 자유롭게 선택해도 되지만, 상업적 이용은 불가능합니다.
        </div>
    );
}
export default UserAgreePage;